coq/aula12.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="pt" xml:lang="pt">
<head>
<!-- 2018-05-25 sex 20:06 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Aula 12 - Variações de táticas e outras táticas</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Rafael Castro - rafaelcgs10.github.io/coq" />
<link rel="stylesheet" type="text/css" href="style.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Aula 12 - Variações de táticas e outras táticas</h1>

<div id="outline-container-org619ca61" class="outline-2">
<h2 id="org619ca61"><span class="section-number-2">1</span> Táticas em hipóteses</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orge683374" class="outline-3">
<h3 id="orge683374"><span class="section-number-3">1.1</span> Aplicando <i>simpl</i> em hipóteses</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>As táticas que vimos funcionam todas modificando o contexto, sem modificar hipóteses do contexto. Algumas adicionam hipóteses ao contexto, é claro.</li>
<li>A cláusula <i>in</i> especifica premissa do contexto a tática será aplicada.</li>
</ul>
<div class="org-src-container">
<pre class="src src-coq">Theorem S_inj : forall (n m : nat) (b : bool),
     beq_nat (S n) (S m) = b  -&gt;
     beq_nat n m = b.
Proof.
  intros n m b H. simpl in H. apply H.  Qed.
</pre>
</div>
</div>
</div>

<div id="outline-container-org624caa8" class="outline-3">
<h3 id="org624caa8"><span class="section-number-3">1.2</span> Aplicando <i>apply</i> em hipóteses</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Similarmente, <i>apply</i> numa hipótese também pode ser aplicado com <i>in</i>.</li>
<li>Porém, ao contrário de <i>apply H</i> (sem <i>in</i>) que requer que a conclusão da hipótese <i>H</i> seja unificável com o objetivo, <i>apply H1 in H2</i> requer que a premissa da hipótese <i>H1</i> unifique com <i>H2</i>.</li>
</ul>
<div class="org-src-container">
<pre class="src src-coq">Theorem silly3' : forall (n : nat),
  (beq_nat n 5 = true -&gt; beq_nat (S (S n)) 7 = true) -&gt;
  true = beq_nat n 5  -&gt;
  true = beq_nat (S (S n)) 7.
Proof.
  intros n eq H.
  symmetry in H. apply eq in H. symmetry in H.
  apply H.  Qed.
</pre>
</div>
</div>
</div>

<div id="outline-container-org9f1a9b5" class="outline-3">
<h3 id="org9f1a9b5"><span class="section-number-3">1.3</span> Quando a hipótese não é exatamente a que queremos!</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>Na prova abaixo a conclusão da hipótese de indução <i>IHn'</i> não é igual ao objetivo.</li>
<li>O problema é que quando demos <i>intros</i> em <i>m</i>, nós consideramos a prova para um <i>m</i> em particular.</li>
</ul>
<div class="org-src-container">
<pre class="src src-coq">Theorem double_injective_FAILED : forall n m,
     double n = double m -&gt; n = m.
Proof.
  intros n m. induction n as [| n'].
  - (* n = O *) simpl. intros eq. destruct m as [| m'].
    + reflexivity. +  inversion eq.
  - (* n = S n' *) intros eq. destruct m as [| m'].
    + inversion eq. + apply f_equal.
      Abort.
</pre>
</div>
</div>
</div>

<div id="outline-container-org9a3c3c2" class="outline-3">
<h3 id="org9a3c3c2"><span class="section-number-3">1.4</span> Como provar o teorema anterior</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>Algumas vezes precisamos de hipóteses quantificadas!</li>
<li>Utilizamos <i>intros</i> apenas em <i>n</i>.</li>
<li>Observe que a hipotese de indução vai estar quantificada em <i>m</i>. E que isso permite utilizar <i>apply</i> no último caso.</li>
</ul>

<div class="org-src-container">
<pre class="src src-coq"> Theorem double_injective : forall n m,
     double n = double m -&gt; n = m.
Proof.
  intros n. induction n as [| n'].
  - (* n = O *) simpl. intros m eq. destruct m as [| m'].
    +  reflexivity. + inversion eq.
  - (* n = S n' *) simpl.
    intros m eq.
    destruct m as [| m'].
    +  simpl. inversion eq. + apply f_equal.
      apply IHn'. inversion eq. reflexivity. Qed.
</pre>
</div>
</div>
</div>

<div id="outline-container-org3d22971" class="outline-3">
<h3 id="org3d22971"><span class="section-number-3">1.5</span> A mesma prova, mas com indução em <i>m</i></h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>Algumas vezes utilizar menos variáveis em <i>intros</i> não é possível.</li>
<li>Se utilizarmos <i>induction</i> em <i>m</i>, teremos o mesmo problema de antes e agora não pode utilizar menos variáveis em <i>intros</i>, pois <i>m</i> ocorre depois de <i>n</i> na quantificação.</li>
</ul>
<div class="org-src-container">
<pre class="src src-coq">Theorem double_injective_take2_FAILED : forall n m,
     double n = double m -&gt; n = m.
Proof.
  intros n m. induction m as [| m'].
  - (* m = O *) simpl. intros eq. destruct n as [| n'].
    + (* n = O *) reflexivity. + (* n = S n' *) inversion eq.
  - (* m = S m' *) intros eq. destruct n as [| n'].
    + (* n = O *) inversion eq. + (* n = S n' *) apply f_equal.
Abort.
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf26225d" class="outline-3">
<h3 id="orgf26225d"><span class="section-number-3">1.6</span> A tática <i>generalize dependent</i></h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li>A tática <i>generalize dependent</i> permite re-quantificar uma dada variável.</li>
</ul>
<div class="org-src-container">
<pre class="src src-coq">Theorem double_injective_take2 : forall n m,
     double n = double m -&gt; n = m.
Proof.
  intros n m.
  generalize dependent n.
  induction m as [| m'].
  - (* m = O *) simpl. intros n eq. destruct n as [| n'].
    + (* n = O *) reflexivity.
    + (* n = S n' *) inversion eq.
  - (* m = S m' *) intros n eq. destruct n as [| n'].
    + (* n = O *) inversion eq.
    + (* n = S n' *) apply f_equal.
      apply IHm'. inversion eq. reflexivity. Qed.
</pre>
</div>
</div>
</div>

<div id="outline-container-org69b484d" class="outline-3">
<h3 id="org69b484d"><span class="section-number-3">1.7</span> A tática unfold</h3>
<div class="outline-text-3" id="text-1-7">
<ul class="org-ul">
<li>Algumas vezes quando tentanto fazer simplificação com <i>simpl</i> nada acontece.</li>
<li>A tática <i>unfold</i> substitui um termo pelo lado direito da sua definição.</li>
<li>Sabemos que multiplicação é comutativa e associativa. Isso irá nos ajudar avançar na prova.</li>
</ul>
<div class="org-src-container">
<pre class="src src-coq">Definition square n := n * n.
Lemma square_mult : forall n m, square (n * m) = 
                            square n * square m.
Proof.
  intros n m. simpl.
  unfold square. rewrite mult_assoc.
  assert (H : n * m * n = n * n * m).
  { rewrite mult_comm. apply mult_assoc. }
  rewrite H. rewrite mult_assoc. reflexivity. Qed.
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org9ed5fc7" class="outline-2">
<h2 id="org9ed5fc7"><span class="section-number-2">2</span> Análise de caso em expressões compostas</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org21a846b" class="outline-3">
<h3 id="org21a846b"><span class="section-number-3">2.1</span> Análise de caso em expressões compostas</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Vimos como utilizar <i>destruct</i> numa variável para fazer análise de caso na mesma.</li>
<li>Porém, algumas vezes queremos (e podemos) fazer a análise de caso no resultado de alguma computação de alguma expressão.</li>
</ul>
</div>
</div>

<div id="outline-container-org3703664" class="outline-3">
<h3 id="org3703664"><span class="section-number-3">2.2</span> Exemplo de análise de caso de expressão composta</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-coq">Definition sillyfun (n : nat) : bool :=
  if beq_nat n 3 then false
  else if beq_nat n 5 then false
  else false.

Theorem sillyfun_false : forall (n : nat),
  sillyfun n = false.
Proof.
  intros n. unfold sillyfun.
  destruct (beq_nat n 3).
    - (* beq_nat n 3 = true *) reflexivity.
    - (* beq_nat n 3 = false *) destruct (beq_nat n 5).
      + (* beq_nat n 5 = true *) reflexivity.
      + (* beq_nat n 5 = false *) reflexivity.  Qed.
</pre>
</div>
</div>
</div>

<div id="outline-container-org35b8428" class="outline-3">
<h3 id="org35b8428"><span class="section-number-3">2.3</span> Um problema com análise de caso em expressão composta</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>A análise de caso em expressão composta não mantem no contexto as substituições realizadas.</li>
<li>No exemplo abaixo é considerado <i>beq _nat n 3 = true</i>, mas essa informação útil não ocorre no contexto.</li>
</ul>
<div class="org-src-container">
<pre class="src src-coq">Theorem sillyfun1_odd_FAILED : forall (n : nat),
     sillyfun1 n = true -&gt;
     oddb n = true.
Proof.
  intros n eq. unfold sillyfun1 in eq.
  destruct (beq_nat n 3).
  (* stuck... *)
Abort.
</pre>
</div>
</div>
</div>

<div id="outline-container-org13f82db" class="outline-3">
<h3 id="org13f82db"><span class="section-number-3">2.4</span> O qualificador <i>eqn</i></h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li>O qualificador <i>eqn</i> permite que a informação da igualdade seja adicionada ao contexto.</li>
</ul>
<div class="org-src-container">
<pre class="src src-coq">Theorem sillyfun1_odd : forall (n : nat),
     sillyfun1 n = true -&gt;
     oddb n = true.
Proof.
  intros n eq. unfold sillyfun1 in eq.
  destruct (beq_nat n 3) eqn:Heqe3.
    - (* e3 = true *) apply beq_nat_true in Heqe3.
      rewrite -&gt; Heqe3. reflexivity.
    - (* e3 = false *)
      destruct (beq_nat n 5) eqn:Heqe5.
        + (* e5 = true *)
          apply beq_nat_true in Heqe5. rewrite -&gt; Heqe5. reflexivity.
        + (* e5 = false *) inversion eq.  Qed.
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 28/05/2018</p>
<p class="author">Author: Rafael Castro - rafaelcgs10.github.io/coq</p>
<p class="date">Created: 2018-05-25 sex 20:06</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
